# Definitions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Definitions Properties
Definitions Class See Also
---
The Definitions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Identifies if the definitions collection is empty. |
| Item | Retrieves a definition by a given name. |
| Size | The number of definitions in the collection. |

# See Also
Definitions Class
Autodesk.Revit.DB Namespace